Repository: sikuli/sikuli
Catalog: sikuli-ide/resources/i18n/IDE/IDE-*.po
Languages: bg, ru

source: File
ru: Файл

source: Edit
bg: Редактиране
ru: Правка

# menuRun
source: Run
bg: Изпълнение
ru: Выполнить

source: View
bg: Изглед
ru: Вид

source: New
bg: Ново
ru: Создать

source: Open...
bg: Отваряне...
ru: Открыть...

source: Save
bg: Запазване
ru: Сохранить

source: Save as...
bg: Запазване като…
ru: Сохранить как...

source: Export excutable...
bg: Изнасяне на изпълним файл...
ru: Сохранить как запускаемый файл

source: Preferences...
bg: Настройки...
ru: Настройки...

source: Close Tab
bg: Затваряне на подпрозореца
ru: Закрыть вкладку

source: Quit
bg: Изход
ru: Выход

source: Cut
bg: Изрязване
ru: Вырезать

source: Copy
bg: Копиране
ru: Копировать

source: Paste
bg: Поставяне
ru: Вставить

source: Select All
bg: Избиране на всичко
ru: Выделить всё

source: Indent
bg: Отстъп
ru: Сделать отступ

source: Un-Indent
bg: Махане на отстъп
ru: Убрать отступ

# menuRunRun
source: Run
bg: Изпълнение
ru: Выполнить

source: Run and show actions
ru: Выполнить и показать действия

source: Stop
bg: Спиране
ru: Остановить

# menuViewUnitTest
source: Unit Test
ru: Юнит-тест

# menuViewCommandList
source: Command List
bg: Списък с команди
ru: Список команд

source: Help
bg: Помощ
ru: Справка

source: Check Update...
bg: Проверка за обновление...
ru: Проверить обновления

source: The Complete Guide to Sikuli Script
bg: Пълно ръководство за Sikuli Script
ru: Полное руководство по Sikuli Script

source: Tutorials, Examples, How-To's
ru: Уроки, примеры, инструкции

source: Ask Questions & Find Answers
bg: Задайте въпроси и отрийте отговори
ru: Задать вопросы и найти ответы

source: Report a Bug
bg: Докладване за грешка
ru: Сообщить об ошибке

source: Sikuli's Homepage
bg: Домашната страница на Sikuli
ru: Домашняя страница Sikuli

source: Sikuli {0} is available!
bg: Налична е Sikuli версия {0}!
ru: Доступен Sikuli {0}!

source: No update is available.
bg: Няма налично обновление.
ru: Нет доступных обновлений.

source: Auto Capture
bg: Автоматично прихващане
ru: Автоматический захват

# cmdListCommandList
source: Command List
bg: Списък с команди
ru: Список команд

source: Message
bg: Съобщение
ru: Сообщение

source: Test Trace
ru: Тестовый запуск

source: Untitled
bg: Без име
ru: Безымянный

# tabUnitTest
source: Unit Test
ru: Юнит-тест

source: Run ({0})
bg: Изпълнение ({0})
ru: Запустить ({0})

source: Press {0} to stop
bg: Натиснете {0} за спиране
ru: Нажмите {0} для остановки

source: Create a region to restrict screen matching
ru: Создайте область для ограничения совпадений

source: Take a screenshot ({0})
bg: Снимка на екрана ({0})
ru: Сделать снимок экрана ({0})

source: Insert an image from disks
bg: Вмъкване на изображение от дисковете
ru: Вставить изображение с дисков

source: Runtime Error when running {0} {1}
bg: Грешка при изпълнение на {0} {1}
ru: Ошибка выполнения при запуске {0} {1}

source: Exited with code {0}
bg: Изход с код {0}
ru: Выход с кодом {0}

source: Stopped
bg: Спряно
ru: Остановлено

source: An error occurs at line {0}
bg: Получава се грешка на ред {0}
ru: Ошибка происходит на строке {0}

source: Error message: {0}
bg: Съобщение на грешката: {0}
ru: Сообщение об ошибке: {0}

source: Select a region on the screen
bg: Изберете участък от екрана
ru: Выберите область на экране

source: Preferences
bg: Настройки
ru: Настройки

source: Screen Capturing
bg: Прихващане на екрана
ru: Захват экрана

source: Quick capture hotkey:
bg: Бърз клавиш за прихващане:
ru: Горячая клавиша для быстрого захвата:

source: Delay before capture:
bg: Забяване преди прихващане:
ru: Задержка перед захватом:

source: seconds
bg: секунди
ru: секунд(ы)

source: General Settings
bg: Общи настройки
ru: Общие настройки

source: Check Update Automatically
bg: Автоматична проверка за обновление
ru: Автоматически проверять обновления

source: Do you want to close this tab?
bg: Да се затвори ли този подпрозорец?
ru: Закрыть эту вкладку?

source: {0} has been modified. Save changes?
bg: {0} беше промемен. Запазване на промените?
ru: {0} изменен. Сохранить?

source: Line: {0,number,integer}, Column: {1,number,integer}
bg: Ред: {0,number,integer}, Колона: {1,number,integer}
ru: Строка: {0,number,integer}, Столбец: {1,number,integer}

source: Pattern Settings
bg: Настройка на шаблон
ru: Настройки шаблонов

source: Matching Preview
bg: Преглед на съвпадението
ru: Предпросмотр совпадений

source: Target Offset
bg: Изместване на целта
ru: Смещение цели

source: Similarity:
bg: Сходство:
ru: Схожесть:

source: Number of matches:
bg: Брой съвпадения:
ru: Количество совпадений:

source: Target offset X:
bg: ИЗместване на целта по Х:
ru: Смещение цели по Х:

source: Cancel
bg: Отказ
ru: Отмена

source: Yes
bg: Да
ru: Да

source: No
bg: Не
ru: Нет

source: Looks for the best matched GUI component on the screen or in the Region.
bg: Търси най-пълно съвпадащия елемент на ГПИ на екрана или в участъка.
ru: Ищет самый подходящий элемент интерфейса на экране или в области.

source: Looks for all matched GUI component on the screen or in the Region.
bg: Търси всички съвпадащи елементи на ГПИ на екрана или в участъка.
ru: Ищет все подходящие элементы интерфейса на экране или в области.

source: Waits the given GUI component to appear on the screen or in the Region for up to <i>timeout</i> seconds.
bg: В продължение на <i>timeout</i> секунди изчаква даден елемент на ГПИ да се появи на екрана или в участък.
ru: Ожидает появления данного компонента интерфейса на экране или в области до <i>определенного количества</i> секунд.

source: Waits the given GUI component to disappear on the screen or in the Region for up to <i>timeout</i> seconds.
bg: В продължение на <i>timeout</i> секунди изчаква даден елемент на ГПИ да се изчезне от екрана или участък.
ru: Ожидает исчезновения данного компонента интерфейса на экране или в области до <i>определенного количества</i> секунд

source: Checks if the given GUI component exists on the screen or in the Region.<br>If it can not be found, None is returned without throwing an exception.
ru: Проверяет, существует ли данный компонент интерфейса на экране или в области.<br>Если компонент не найден, возвращает None без возникновения исключения.

source: Clicks on the best matched GUI component on the screen or in the Region.
bg: Цъкане на най-пълно съвпадащият елемент на ГПИ на екрана или в участък.
ru: Кликает на самом подходящем элементе интерфейса на экране или в области.

source: Double clicks on the best matched GUI component on the screen or in the Region.
bg: Двойно цъкане на най-пълно съвпадащият елемент на ГПИ на екрана или в участък.
ru: Два раза кликает на самом подходящем элементе интерфейса на экране или в области.

source: Right clicks on the best matched GUI component on the screen or in the Region.
bg: Дясно цъкане на най-пълно съвпадащия елемент на ГПИ на екрана или в участък.
ru: Делает правый клик на самом подходящем элементе интерфейса на экране или в области.

source: Moves the mouse cursor on the best matched GUI component.
bg: Премества показалеца на мишка на най-пълно съвпадащия компонент на ГПИ.
ru: Перемещает курсор мыши на самый подходящий элемент интерфейса на экране или в области.

source: Drags the first component, and drops at the second component.
bg: Влачи първият компонент и го пуска върху втория.
ru: Перетаскивает первый компонент и бросает его на второй.

source: Types the given <i>text</i> to the current focused window.
bg: Изписва посоченото <i>text</i> в текущо фокусирания прозорец.
ru: Вводит данный <i>текст</i> в текущее окно в фокусе.

source: Clicks on the given component to gain the focus and then types the given <i>text</i>.
bg: Цъка върху указания компонент за да го фокусира, след което изписва <i>text</i>.
ru: Кликает на данный элемент для получения фокуса и вводит данный <i>текст</i>.

source: Pastes the given <i>text</i> to the current focused window.
bg: Поставя <i>text</i> в текущо фокусирания прозорец
ru: Вставляет данный <i>текст</i> в текущее окно в фокусе.

source: Clicks on the given component to gain the focus and then pastes the given <i>text</i>.
ru: Кликает на данный элемент для получения фокуса и вставляет туда данный <i>текст</i>.

source: Calls <i>handler</i> when the given image pattern appears on the screen or in the Region.
ru: Вызывает <i>обработчик</i> когда данный шаблон изображения возникает на экране или в области.

source: Calls <i>handler</i> when the given image pattern disappears on the screen or in the Region.
ru: Вызывает <i>обработчик</i> когда данный шаблон изображения исчезает с экрана или из области.

source: Calls <i>handler</i> when anything is changed on the screen or in the Region.
ru: Вызывает <i>обработчик</i> когда что-нибудь изменяется на экране или в области.

source: Starts the observer to watch the screen or the Region for up to <i>time</i> seconds.<br>The observer will be run in the background if <i>background</i> is set to True.
ru: Запускает наблюдателя для слежения за экраном или областью до <i>секунд</i>.<br>Наблюдатель будет запущен в фоновом режиме, если <i>background</i> установлен в True.

source: OK
bg: Добре
